jadjer/esp32-nimble/src/Server.cpp
// Copyright 2024 Pavel Suprunov
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "sdkconfig.h"
#if defined(CONFIG_BT_NIMBLE_ENABLED) && defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)

#include "nimble/Device.hpp"
#include "nimble/Log.hpp"
#include "nimble/Server.hpp"

#include "services/gap/ble_svc_gap.h"
#include "services/gatt/ble_svc_gatt.h"

namespace nimble {

static const char *LOG_TAG = "NimBLEServer";
static NimBLEServerCallbacks defaultCallbacks;

/**
 * @brief Construct a %BLE Server
 *
 * This class is not designed to be individually instantiated.  Instead one should create a server by asking
 * the NimBLEDevice class.
 */
Server::Server() {
  memset(m_indWait, BLE_HS_CONN_HANDLE_NONE, sizeof(m_indWait));
  //    m_svcChgChrHdl          = 0xffff; // Future Use
  m_pServerCallbacks = &defaultCallbacks;
  m_gattsStarted = false;
#if !CONFIG_BT_NIMBLE_EXT_ADV
  m_advertiseOnDisconnect = true;
#endif
  m_svcChanged = false;
  m_deleteCallbacks = true;
}// NimBLEServer

/**
 * @brief Destructor: frees all resources / attributes created.
 */
Server::~Server() {
  for (auto &it : m_svcVec) {
    delete it;
  }

  if (m_deleteCallbacks && m_pServerCallbacks != &defaultCallbacks) {
    delete m_pServerCallbacks;
  }
}

/**
 * @brief Create a %BLE Service.
 * @param [in] uuid The UUID of the new service.
 * @return A reference to the new service object.
 */
Service *Server::createService(const char *uuid) {
  return createService(UUID(uuid));
}// createService

/**
 * @brief Create a %BLE Service.
 * @param [in] uuid The UUID of the new service.
 * @return A reference to the new service object.
 */
Service *Server::createService(const UUID &uuid) {
  NIMBLE_LOGD(LOG_TAG, ">> createService - %s", uuid.toString().c_str());

  // Check that a service with the supplied UUID does not already exist.
  if (getServiceByUUID(uuid) != nullptr) {
    NIMBLE_LOGW(LOG_TAG, "Warning creating a duplicate service UUID: %s",
                std::string(uuid).c_str());
  }

  Service *pService = new Service(uuid);
  m_svcVec.push_back(pService);
  serviceChanged();

  NIMBLE_LOGD(LOG_TAG, "<< createService");
  return pService;
}// createService

/**
 * @brief Get a %BLE Service by its UUID
 * @param [in] uuid The UUID of the service.
 * @param instanceId The index of the service to return (used when multiple services have the same UUID).
 * @return A pointer to the service object or nullptr if not found.
 */
Service *Server::getServiceByUUID(const char *uuid, uint16_t instanceId) {
  return getServiceByUUID(UUID(uuid), instanceId);
}// getServiceByUUID

/**
 * @brief Get a %BLE Service by its UUID
 * @param [in] uuid The UUID of the service.
 * @param instanceId The index of the service to return (used when multiple services have the same UUID).
 * @return A pointer to the service object or nullptr if not found.
 */
Service *Server::getServiceByUUID(const UUID &uuid, uint16_t instanceId) {
  uint16_t position = 0;
  for (auto &it : m_svcVec) {
    if (it->getUUID() == uuid) {
      if (position == instanceId) {
        return it;
      }
      position++;
    }
  }
  return nullptr;
}// getServiceByUUID

/**
 * @brief Get a %BLE Service by its handle
 * @param handle The handle of the service.
 * @return A pointer to the service object or nullptr if not found.
 */
Service *Server::getServiceByHandle(uint16_t handle) {
  for (auto &it : m_svcVec) {
    if (it->getHandle() == handle) {
      return it;
    }
  }
  return nullptr;
}

#if CONFIG_BT_NIMBLE_EXT_ADV
/**
 * @brief Retrieve the advertising object that can be used to advertise the existence of the server.
 * @return An advertising object.
 */
NimBLEExtAdvertising *NimBLEServer::getAdvertising() {
  return NimBLEDevice::getAdvertising();
}// getAdvertising
#endif

#if !CONFIG_BT_NIMBLE_EXT_ADV || defined(_DOXYGEN_)
/**
 * @brief Retrieve the advertising object that can be used to advertise the existence of the server.
 * @return An advertising object.
 */
Advertising *Server::getAdvertising() {
  return Device::getAdvertising();
}// getAdvertising
#endif

/**
 * @brief Sends a service changed notification and resets the GATT server.
 */
void Server::serviceChanged() {
  if (m_gattsStarted) {
    m_svcChanged = true;
    ble_svc_gatt_changed(0x0001, 0xffff);
    resetGATT();
  }
}

/**
 * @brief Start the GATT server. Required to be called after setup of all
 * services and characteristics / descriptors for the NimBLE host to register them.
 */
void Server::start() {
  if (m_gattsStarted) {
    NIMBLE_LOGW(LOG_TAG, "Gatt server already started");
    return;
  }

  int rc = ble_gatts_start();
  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "ble_gatts_start; rc=%d, %s", rc, Utils::returnCodeToString(rc));
    abort();
  }

#if CONFIG_NIMBLE_CPP_LOG_LEVEL >= 4
  ble_gatts_show_local();
#endif
  /*** Future use ***
  * TODO: implement service changed handling

    ble_uuid16_t svc = {BLE_UUID_TYPE_16, 0x1801};
    ble_uuid16_t chr = {BLE_UUID_TYPE_16, 0x2a05};

    rc = ble_gatts_find_chr(&svc.u, &chr.u, NULL, &m_svcChgChrHdl);
    if(rc != 0) {
        NIMBLE_LOGE(LOG_TAG, "ble_gatts_find_chr: rc=%d, %s", rc,
                            NimBLEUtils::returnCodeToString(rc));
        abort();
    }

    NIMBLE_LOGI(LOG_TAG, "Service changed characterisic handle: %d", m_svcChgChrHdl);
*/
  // Get the assigned service handles and build a vector of characteristics
  // with Notify / Indicate capabilities for event handling
  for (auto &svc : m_svcVec) {
    if (svc->m_removed == 0) {
      rc = ble_gatts_find_svc(&svc->getUUID().getNative()->u, &svc->m_handle);
      if (rc != 0) {
        abort();
      }
    }

    for (auto &chr : svc->m_chrVec) {
      // if Notify / Indicate is enabled but we didn't create the descriptor
      // we do it now.
      if ((chr->m_properties & BLE_GATT_CHR_F_INDICATE) || (chr->m_properties & BLE_GATT_CHR_F_NOTIFY)) {
        m_notifyChrVec.push_back(chr);
      }
    }
  }

  m_gattsStarted = true;
}// start

/**
 * @brief Disconnect the specified client with optional reason.
 * @param [in] connId Connection Id of the client to disconnect.
 * @param [in] reason code for disconnecting.
 * @return NimBLE host return code.
 */
int Server::disconnect(uint16_t connId, uint8_t reason) {
  NIMBLE_LOGD(LOG_TAG, ">> disconnect()");

