jadjer/esp32-nimble/src/Server.cpp
  int rc = ble_gap_terminate(connId, reason);
  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "ble_gap_terminate failed: rc=%d %s", rc,
                Utils::returnCodeToString(rc));
  }

  NIMBLE_LOGD(LOG_TAG, "<< disconnect()");
  return rc;
}// disconnect

#if !CONFIG_BT_NIMBLE_EXT_ADV || defined(_DOXYGEN_)
/**
 * @brief Set the server to automatically start advertising when a client disconnects.
 * @param [in] aod true == advertise, false == don't advertise.
 */
void Server::advertiseOnDisconnect(bool aod) {
  m_advertiseOnDisconnect = aod;
}// advertiseOnDisconnect
#endif

/**
 * @brief Return the number of connected clients.
 * @return The number of connected clients.
 */
size_t Server::getConnectedCount() {
  return m_connectedPeersVec.size();
}// getConnectedCount

/**
 * @brief Get the vector of the connected client ID's.
 */
std::vector<uint16_t> Server::getPeerDevices() {
  return m_connectedPeersVec;
}// getPeerDevices

/**
 * @brief Get the connection information of a connected peer by vector index.
 * @param [in] index The vector index of the peer.
 */
ConnectionInfo Server::getPeerInfo(size_t index) {
  if (index >= m_connectedPeersVec.size()) {
    NIMBLE_LOGE(LOG_TAG, "No peer at index %u", index);
    return ConnectionInfo();
  }

  return getPeerIDInfo(m_connectedPeersVec[index]);
}// getPeerInfo

/**
 * @brief Get the connection information of a connected peer by address.
 * @param [in] address The address of the peer.
 */
ConnectionInfo Server::getPeerInfo(const Address &address) {
  ble_addr_t peerAddr;
  memcpy(&peerAddr.val, address.getNative(), 6);
  peerAddr.type = address.getType();

  ConnectionInfo peerInfo;
  int rc = ble_gap_conn_find_by_addr(&peerAddr, &peerInfo.m_desc);
  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "Peer info not found");
  }

  return peerInfo;
}// getPeerInfo

/**
 * @brief Get the connection information of a connected peer by connection ID.
 * @param [in] id The connection id of the peer.
 */
ConnectionInfo Server::getPeerIDInfo(uint16_t id) {
  ConnectionInfo peerInfo;

  int rc = ble_gap_conn_find(id, &peerInfo.m_desc);
  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "Peer info not found");
  }

  return peerInfo;
}// getPeerIDInfo

/**
 * @brief Handle a GATT Server Event.
 *
 * @param [in] event
 * @param [in] gatts_if
 * @param [in] param
 *
 */
/*STATIC*/
int Server::handleGapEvent(struct ble_gap_event *event, void *arg) {
  NIMBLE_LOGD(LOG_TAG, ">> handleGapEvent: %s", Utils::gapEventToString(event->type));

  int rc = 0;
  ConnectionInfo peerInfo;
  Server *pServer = NimBLEDevice::getServer();

  switch (event->type) {

  case BLE_GAP_EVENT_CONNECT: {
    if (event->connect.status != 0) {
      /* Connection failed; resume advertising */
      NIMBLE_LOGE(LOG_TAG, "Connection failed");
#if !CONFIG_BT_NIMBLE_EXT_ADV
      NimBLEDevice::startAdvertising();
#endif
    } else {
      pServer->m_connectedPeersVec.push_back(event->connect.conn_handle);

      rc = ble_gap_conn_find(event->connect.conn_handle, &peerInfo.m_desc);
      if (rc != 0) {
        return 0;
      }

      pServer->m_pServerCallbacks->onConnect(pServer, peerInfo);
    }

    return 0;
  }// BLE_GAP_EVENT_CONNECT

  case BLE_GAP_EVENT_DISCONNECT: {
    // If Host reset tell the device now before returning to prevent
    // any errors caused by calling host functions before resync.
    switch (event->disconnect.reason) {
    case BLE_HS_ETIMEOUT_HCI:
    case BLE_HS_EOS:
    case BLE_HS_ECONTROLLER:
    case BLE_HS_ENOTSYNCED:
      NIMBLE_LOGC(LOG_TAG, "Disconnect - host reset, rc=%d", event->disconnect.reason);
      NimBLEDevice::onReset(event->disconnect.reason);
      break;
    default:
      break;
    }

    pServer->m_connectedPeersVec.erase(std::remove(pServer->m_connectedPeersVec.begin(),
                                                   pServer->m_connectedPeersVec.end(),
                                                   event->disconnect.conn.conn_handle),
                                       pServer->m_connectedPeersVec.end());

    if (pServer->m_svcChanged) {
      pServer->resetGATT();
    }

    ConnectionInfo peerInfo(event->disconnect.conn);
    pServer->m_pServerCallbacks->onDisconnect(pServer, peerInfo, event->disconnect.reason);

#if !CONFIG_BT_NIMBLE_EXT_ADV
    if (pServer->m_advertiseOnDisconnect) {
      pServer->startAdvertising();
    }
#endif
    return 0;
  }// BLE_GAP_EVENT_DISCONNECT

  case BLE_GAP_EVENT_SUBSCRIBE: {
    NIMBLE_LOGI(LOG_TAG, "subscribe event; attr_handle=%d, subscribed: %s",
                event->subscribe.attr_handle,
                (event->subscribe.cur_notify ? "true" : "false"));

    for (auto &it : pServer->m_notifyChrVec) {
      if (it->getHandle() == event->subscribe.attr_handle) {
        if ((it->getProperties() & BLE_GATT_CHR_F_READ_AUTHEN) || (it->getProperties() & BLE_GATT_CHR_F_READ_AUTHOR) || (it->getProperties() & BLE_GATT_CHR_F_READ_ENC)) {
          rc = ble_gap_conn_find(event->subscribe.conn_handle, &peerInfo.m_desc);
          if (rc != 0) {
            break;
          }

          if (!peerInfo.isEncrypted()) {
            NimBLEDevice::startSecurity(event->subscribe.conn_handle);
          }
        }

        it->setSubscribe(event);
        break;
      }
    }

    return 0;
  }// BLE_GAP_EVENT_SUBSCRIBE

  case BLE_GAP_EVENT_MTU: {
    NIMBLE_LOGI(LOG_TAG, "mtu update event; conn_handle=%d mtu=%d",
                event->mtu.conn_handle,
                event->mtu.value);

    rc = ble_gap_conn_find(event->mtu.conn_handle, &peerInfo.m_desc);
    if (rc != 0) {
      return 0;
    }

    pServer->m_pServerCallbacks->onMTUChange(event->mtu.value, peerInfo);
    return 0;
  }// BLE_GAP_EVENT_MTU

  case BLE_GAP_EVENT_NOTIFY_TX: {
    Characteristic *pChar = nullptr;

    for (auto &it : pServer->m_notifyChrVec) {
      if (it->getHandle() == event->notify_tx.attr_handle) {
        pChar = it;
      }
    }

    if (pChar == nullptr) {
      return 0;
    }

    if (event->notify_tx.indication) {
      if (event->notify_tx.status == 0) {
        return 0;// Indication sent but not yet acknowledged.
      }
      pServer->clearIndicateWait(event->notify_tx.conn_handle);
    }

    pChar->m_pCallbacks->onStatus(pChar, event->notify_tx.status);

