jadjer/esp32-nimble/src/Server.cpp
    return 0;
  }// BLE_GAP_EVENT_NOTIFY_TX

  case BLE_GAP_EVENT_ADV_COMPLETE:
#if CONFIG_BT_NIMBLE_EXT_ADV
  case BLE_GAP_EVENT_SCAN_REQ_RCVD:
    return NimBLEExtAdvertising::handleGapEvent(event, arg);
#else
    return Advertising::handleGapEvent(event, arg);
#endif
    // BLE_GAP_EVENT_ADV_COMPLETE | BLE_GAP_EVENT_SCAN_REQ_RCVD

  case BLE_GAP_EVENT_CONN_UPDATE: {
    NIMBLE_LOGD(LOG_TAG, "Connection parameters updated.");
    return 0;
  }// BLE_GAP_EVENT_CONN_UPDATE

  case BLE_GAP_EVENT_REPEAT_PAIRING: {
    /* We already have a bond with the peer, but it is attempting to
             * establish a new secure link.  This app sacrifices security for
             * convenience: just throw away the old bond and accept the new link.
             */

    /* Delete the old bond. */
    rc = ble_gap_conn_find(event->repeat_pairing.conn_handle, &peerInfo.m_desc);
    if (rc != 0) {
      return BLE_GAP_REPEAT_PAIRING_IGNORE;
    }

    ble_store_util_delete_peer(&peerInfo.m_desc.peer_id_addr);

    /* Return BLE_GAP_REPEAT_PAIRING_RETRY to indicate that the host should
             * continue with the pairing operation.
             */
    return BLE_GAP_REPEAT_PAIRING_RETRY;
  }// BLE_GAP_EVENT_REPEAT_PAIRING

  case BLE_GAP_EVENT_ENC_CHANGE: {
    rc = ble_gap_conn_find(event->enc_change.conn_handle, &peerInfo.m_desc);
    if (rc != 0) {
      return BLE_ATT_ERR_INVALID_HANDLE;
    }

    pServer->m_pServerCallbacks->onAuthenticationComplete(peerInfo);
    return 0;
  }// BLE_GAP_EVENT_ENC_CHANGE

  case BLE_GAP_EVENT_PASSKEY_ACTION: {
    struct ble_sm_io pkey = {0, 0};

    if (event->passkey.params.action == BLE_SM_IOACT_DISP) {
      pkey.action = event->passkey.params.action;
      // backward compatibility
      pkey.passkey = NimBLEDevice::getSecurityPasskey();// This is the passkey to be entered on peer
      // if the (static)passkey is the default, check the callback for custom value
      // both values default to the same.
      if (pkey.passkey == 123456) {
        pkey.passkey = pServer->m_pServerCallbacks->onPassKeyRequest();
      }
      rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
      NIMBLE_LOGD(LOG_TAG, "BLE_SM_IOACT_DISP; ble_sm_inject_io result: %d", rc);

    } else if (event->passkey.params.action == BLE_SM_IOACT_NUMCMP) {
      NIMBLE_LOGD(LOG_TAG, "Passkey on device's display: %" PRIu32, event->passkey.params.numcmp);
      pkey.action = event->passkey.params.action;
      pkey.numcmp_accept = pServer->m_pServerCallbacks->onConfirmPIN(event->passkey.params.numcmp);

      rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
      NIMBLE_LOGD(LOG_TAG, "BLE_SM_IOACT_NUMCMP; ble_sm_inject_io result: %d", rc);

      //TODO: Handle out of band pairing
    } else if (event->passkey.params.action == BLE_SM_IOACT_OOB) {
      static uint8_t tem_oob[16] = {0};
      pkey.action = event->passkey.params.action;
      for (int i = 0; i < 16; i++) {
        pkey.oob[i] = tem_oob[i];
      }
      rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
      NIMBLE_LOGD(LOG_TAG, "BLE_SM_IOACT_OOB; ble_sm_inject_io result: %d", rc);
      //////////////////////////////////
    } else if (event->passkey.params.action == BLE_SM_IOACT_INPUT) {
      NIMBLE_LOGD(LOG_TAG, "Enter the passkey");
      pkey.action = event->passkey.params.action;
      pkey.passkey = pServer->m_pServerCallbacks->onPassKeyRequest();

      rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
      NIMBLE_LOGD(LOG_TAG, "BLE_SM_IOACT_INPUT; ble_sm_inject_io result: %d", rc);

    } else if (event->passkey.params.action == BLE_SM_IOACT_NONE) {
      NIMBLE_LOGD(LOG_TAG, "No passkey action required");
    }

    NIMBLE_LOGD(LOG_TAG, "<< handleGATTServerEvent");
    return 0;
  }// BLE_GAP_EVENT_PASSKEY_ACTION

  default:
    break;
  }

  NIMBLE_LOGD(LOG_TAG, "<< handleGATTServerEvent");
  return 0;
}// handleGapEvent

/**
 * @brief Set the server callbacks.
 *
 * As a %BLE server operates, it will generate server level events such as a new client connecting or a previous client
 * disconnecting.  This function can be called to register a callback handler that will be invoked when these
 * events are detected.
 *
 * @param [in] pCallbacks The callbacks to be invoked.
 * @param [in] deleteCallbacks if true callback class will be deleted when server is destructed.
 */
void Server::setCallbacks(NimBLEServerCallbacks *pCallbacks, bool deleteCallbacks) {
  if (pCallbacks != nullptr) {
    m_pServerCallbacks = pCallbacks;
    m_deleteCallbacks = deleteCallbacks;
  } else {
    m_pServerCallbacks = &defaultCallbacks;
  }
}// setCallbacks

/**
 * @brief Remove a service from the server.
 *
 * @details Immediately removes access to the service by clients, sends a service changed indication,
 * and removes the service (if applicable) from the advertisements.
 * The service is not deleted unless the deleteSvc parameter is true, otherwise the service remains
 * available and can be re-added in the future. If desired a removed but not deleted service can
 * be deleted later by calling this method with deleteSvc set to true.
 *
 * @note The service will not be removed from the database until all open connections are closed
 * as it requires resetting the GATT server. In the interim the service will have it's visibility disabled.
 *
 * @note Advertising will need to be restarted by the user after calling this as we must stop
 * advertising in order to remove the service.
 *
 * @param [in] service The service object to remove.
 * @param [in] deleteSvc true if the service should be deleted.
 */
void Server::removeService(Service *service, bool deleteSvc) {
  // Check if the service was already removed and if so check if this
  // is being called to delete the object and do so if requested.
  // Otherwise, ignore the call and return.
  if (service->m_removed > 0) {
    if (deleteSvc) {
      for (auto it = m_svcVec.begin(); it != m_svcVec.end(); ++it) {
        if ((*it) == service) {
          delete *it;
          m_svcVec.erase(it);
          break;
        }
      }
    }

    return;
  }

  int rc = ble_gatts_svc_set_visibility(service->getHandle(), 0);
  if (rc != 0) {
    return;
  }

