jadjer/esp32-nimble/src/Server.cpp
  service->m_removed = deleteSvc ? NIMBLE_ATT_REMOVE_DELETE : NIMBLE_ATT_REMOVE_HIDE;
  serviceChanged();
#if !CONFIG_BT_NIMBLE_EXT_ADV
  NimBLEDevice::getAdvertising()->removeServiceUUID(service->getUUID());
#endif
}

/**
 * @brief Adds a service which was either already created but removed from availability,\n
 * or created and later added to services list.
 * @param [in] service The service object to add.
 * @note If it is desired to advertise the service it must be added by
 * calling NimBLEAdvertising::addServiceUUID.
 */
void Server::addService(Service *service) {
  // Check that a service with the supplied UUID does not already exist.
  if (getServiceByUUID(service->getUUID()) != nullptr) {
    NIMBLE_LOGW(LOG_TAG, "Warning creating a duplicate service UUID: %s",
                std::string(service->getUUID()).c_str());
  }

  // If adding a service that was not removed add it and return.
  // Else reset GATT and send service changed notification.
  if (service->m_removed == 0) {
    m_svcVec.push_back(service);
    return;
  }

  service->m_removed = 0;
  serviceChanged();
}

/**
 * @brief Resets the GATT server, used when services are added/removed after initialization.
 */
void Server::resetGATT() {
  if (getConnectedCount() > 0) {
    return;
  }

  NimBLEDevice::stopAdvertising();
  ble_gatts_reset();
  ble_svc_gap_init();
  ble_svc_gatt_init();

  for (auto it = m_svcVec.begin(); it != m_svcVec.end();) {
    if ((*it)->m_removed > 0) {
      if ((*it)->m_removed == NIMBLE_ATT_REMOVE_DELETE) {
        delete *it;
        it = m_svcVec.erase(it);
      } else {
        ++it;
      }
      continue;
    }

    (*it)->start();
    ++it;
  }

  m_svcChanged = false;
  m_gattsStarted = false;
}

#if CONFIG_BT_NIMBLE_EXT_ADV
/**
 * @brief Start advertising.
 * @param [in] inst_id The extended advertisement instance ID to start.
 * @param [in] duration How long to advertise for in milliseconds, 0 = forever (default).
 * @param [in] max_events Maximum number of advertisement events to send, 0 = no limit (default).
 * @return True if advertising started successfully.
 * @details Start the server advertising its existence.  This is a convenience function and is equivalent to
 * retrieving the advertising object and invoking start upon it.
 */
bool NimBLEServer::startAdvertising(uint8_t inst_id,
                                    int duration,
                                    int max_events) {
  return getAdvertising()->start(inst_id, duration, max_events);
}// startAdvertising

/**
 * @brief Convenience function to stop advertising a data set.
 * @param [in] inst_id The extended advertisement instance ID to stop advertising.
 * @return True if advertising stopped successfully.
 */
bool NimBLEServer::stopAdvertising(uint8_t inst_id) {
  return getAdvertising()->stop(inst_id);
}// stopAdvertising
#endif

#if !CONFIG_BT_NIMBLE_EXT_ADV || defined(_DOXYGEN_)
/**
 * @brief Start advertising.
 * @param [in] duration The duration in milliseconds to advertise for, default = forever.
 * @return True if advertising started successfully.
 * @details Start the server advertising its existence. This is a convenience function and is equivalent to
 * retrieving the advertising object and invoking start upon it.
 */
bool Server::startAdvertising(uint32_t duration) {
  return getAdvertising()->start(duration);
}// startAdvertising
#endif

/**
 * @brief Stop advertising.
 * @return True if advertising stopped successfully.
 */
bool Server::stopAdvertising() {
  return getAdvertising()->stop();
}// stopAdvertising

/**
 * @brief Get the MTU of the client.
 * @returns The client MTU or 0 if not found/connected.
 */
uint16_t Server::getPeerMTU(uint16_t conn_id) {
  return ble_att_mtu(conn_id);
}//getPeerMTU

/**
 * @brief Request an Update the connection parameters:
 * * Can only be used after a connection has been established.
 * @param [in] conn_handle The connection handle of the peer to send the request to.
 * @param [in] minInterval The minimum connection interval in 1.25ms units.
 * @param [in] maxInterval The maximum connection interval in 1.25ms units.
 * @param [in] latency The number of packets allowed to skip (extends max interval).
 * @param [in] timeout The timeout time in 10ms units before disconnecting.
 */
void Server::updateConnParams(uint16_t conn_handle,
                              uint16_t minInterval, uint16_t maxInterval,
                              uint16_t latency, uint16_t timeout) {
  ble_gap_upd_params params;

  params.latency = latency;
  params.itvl_max = maxInterval;                      // max_int = 0x20*1.25ms = 40ms
  params.itvl_min = minInterval;                      // min_int = 0x10*1.25ms = 20ms
  params.supervision_timeout = timeout;               // timeout = 400*10ms = 4000ms
  params.min_ce_len = BLE_GAP_INITIAL_CONN_MIN_CE_LEN;// Minimum length of connection event in 0.625ms units
  params.max_ce_len = BLE_GAP_INITIAL_CONN_MAX_CE_LEN;// Maximum length of connection event in 0.625ms units

  int rc = ble_gap_update_params(conn_handle, &params);
  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "Update params error: %d, %s", rc, Utils::returnCodeToString(rc));
  }
}// updateConnParams

/**
 * @brief Request an update of the data packet length.
 * * Can only be used after a connection has been established.
 * @details Sends a data length update request to the peer.
 * The Data Length Extension (DLE) allows to increase the Data Channel Payload from 27 bytes to up to 251 bytes.
 * The peer needs to support the Bluetooth 4.2 specifications, to be capable of DLE.
 * @param [in] conn_handle The connection handle of the peer to send the request to.
 * @param [in] tx_octets The preferred number of payload octets to use (Range 0x001B-0x00FB).
 */
void Server::setDataLen(uint16_t conn_handle, uint16_t tx_octets) {
#if defined(CONFIG_NIMBLE_CPP_IDF) && !defined(ESP_IDF_VERSION) || (ESP_IDF_VERSION_MAJOR * 100 + ESP_IDF_VERSION_MINOR * 10 + ESP_IDF_VERSION_PATCH) < 432
  return;
#else
  uint16_t tx_time = (tx_octets + 14) * 8;

  int rc = ble_gap_set_data_len(conn_handle, tx_octets, tx_time);
  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "Set data length error: %d, %s", rc, Utils::returnCodeToString(rc));
  }
#endif
}// setDataLen

bool Server::setIndicateWait(uint16_t conn_handle) {
  for (auto i = 0; i < CONFIG_BT_NIMBLE_MAX_CONNECTIONS; i++) {
    if (m_indWait[i] == conn_handle) {
      return false;
    }
  }

  return true;
}

void Server::clearIndicateWait(uint16_t conn_handle) {
  for (auto i = 0; i < CONFIG_BT_NIMBLE_MAX_CONNECTIONS; i++) {
    if (m_indWait[i] == conn_handle) {
      m_indWait[i] = BLE_HS_CONN_HANDLE_NONE;
      return;
    }
  }
}

/** Default callback handlers */
void ServerCallbacks::onConnect(Server *pServer, ConnectionInfo &connInfo) {
  NIMBLE_LOGD("NimBLEServerCallbacks", "onConnect(): Default");
}// onConnect

void ServerCallbacks::onDisconnect(Server *pServer,
                                   ConnectionInfo &connInfo, int reason) {
  NIMBLE_LOGD("NimBLEServerCallbacks", "onDisconnect(): Default");
}// onDisconnect

void ServerCallbacks::onMTUChange(uint16_t MTU, ConnectionInfo &connInfo) {
  NIMBLE_LOGD("NimBLEServerCallbacks", "onMTUChange(): Default");
}// onMTUChange

uint32_t ServerCallbacks::onPassKeyRequest() {
  NIMBLE_LOGD("NimBLEServerCallbacks", "onPassKeyRequest: default: 123456");
  return 123456;
}//onPassKeyRequest

void ServerCallbacks::onAuthenticationComplete(ConnectionInfo &connInfo) {
  NIMBLE_LOGD("NimBLEServerCallbacks", "onAuthenticationComplete: default");
}// onAuthenticationComplete

bool ServerCallbacks::onConfirmPIN(uint32_t pin) {
  NIMBLE_LOGD("NimBLEServerCallbacks", "onConfirmPIN: default: true");
  return true;
}// onConfirmPIN

}

#endif /* CONFIG_BT_ENABLED && CONFIG_BT_NIMBLE_ROLE_PERIPHERAL */
